## Loading Scraped Data into MySQL Database
This notebook I loaded cleaned university data into a MySQL database. The data is first read from a CSV file, and then inserted into a MySQL database using SQLAlchemy and pymysql.

Dependencies: Python installed with pandas, pymysql, and SQLAlchemy libraries.

MySQL server running and accessible.

Cleaned data available in universities_clean.csv.

SQL script files mysql_create_table.sql and mysql_upsert.sql for creating and upserting data into the MySQL table.

## 1. Import Libraries

In [2]:
import pandas as pd     # for data manipulation
import pymysql          # pymysql to connect to MySQL
from sqlalchemy import create_engine       # to create the database engine

## 2. Read the Cleaned Data

In [3]:
# read the data into df
df = pd.read_csv('universities_clean.csv')

In [4]:
# display the first 5 rows
df.head()

,Country,University,Founded,Type,Enrollment,Link
0,Albania,University of Tirana,1957,Public,35000,https://en.wikipedia.org/wiki/University_of_Ti...
1,Algeria,Constantine University,1978,Public,85000,https://en.wikipedia.org/wiki/List_of_universi...
2,Angola,Agostinho Neto University,1962,Public,29827,https://en.wikipedia.org/wiki/Agostinho_Neto_U...
3,Argentina,University of Buenos Aires,1821,Public,311175,https://en.wikipedia.org/wiki/University_of_Bu...
4,Australia,Monash University,1958,Public,73807,https://en.wikipedia.org/wiki/Monash_University

## 3. Establish Connection to MySQL Database

In [ ]:
# define the parameters and set up the connection to the database
conn = pymysql.connect(
    host='localhost',  # Hostname 
    port=3306,  # Port number of the MySQL server
    user='amdariuser',  # Username for the MySQL database
    password='amdariuserpassword',  # Password for the MySQL database
    database='amdaridb'  # Name of the database to connect to
)
  # Create a cursor object to execute SQL queries
cursor = conn.cursor()

## 4. Verify Connection and Database State

In [7]:
# Execute SQL command to show all databases
cursor.execute('SHOW DATABASES;')

3

In [8]:
# check the results to verify the connection
cursor.fetchall()

(('amdaridb',), ('information_schema',), ('performance_schema',))

In [9]:
# Execute SQL command to show all tables in the current database
cursor.execute('SHOW TABLES;')

0

In [10]:
# check the results to verify the connection
cursor.fetchall()

()

## 5. Create Table in MySQL

In [22]:
# create table
create_query_file = open('./sql/mysql_create_table.sql')
create_query = create_query_file.read()
create_query

'CREATE TABLE university(\n    id BIGINT AUTO_INCREMENT NOT NULL,\n    country VARCHAR(255) NOT NULL,\n    name VARCHAR(255) NOT NULL,\n    founded INT NOT NULL,\n    type VARCHAR(255) NOT NULL,\n    enrollment BIGINT NOT NULL,\n    link VARCHAR(255) NOT NULL,\n\n\n    UNIQUE KEY unique_combination (country, name),\n    PRIMARY KEY (id)\n);'

In [23]:
cursor.execute(create_query)

0

## 6. Prepare Data for Insertion

In [31]:
data = list(df.itertuples(index=None, name=None))

In [32]:
data

[('Albania',
  'University of Tirana',
  1957,
  'Public',
  35000,
  'https://en.wikipedia.org/wiki/University_of_Tirana'),
 ('Algeria',
  'Constantine University',
  1978,
  'Public',
  85000,
  'https://en.wikipedia.org/wiki/List_of_universities_in_Algeria'),
 ('Angola',
  'Agostinho Neto University',
  1962,
  'Public',
  29827,
  'https://en.wikipedia.org/wiki/Agostinho_Neto_University'),
 ('Argentina',
  'University of Buenos Aires',
  1821,
  'Public',
  311175,
  'https://en.wikipedia.org/wiki/University_of_Buenos_Aires'),
 ('Australia',
  'Monash University',
  1958,
  'Public',
  73807,
  'https://en.wikipedia.org/wiki/Monash_University'),
 ('Austria',
  'University of Vienna',
  1365,
  'Public',
  91000,
  'https://en.wikipedia.org/wiki/University_of_Vienna'),
 ('Bangladesh',
  'National University, Bangladesh',
  1992,
  'Public',
  2097,
  'https://en.wikipedia.org/wiki/National_University,_Bangladesh'),
 ('Belarus',
  'Belarusian State University',
  1921,
  'Public',
  25500,
  'https://en.wikipedia.org/wiki/Belarusian_State_University'),
 ('Belgium',
  'KU Leuven',
  1425,
  'Private, state-funded',
  55484,
  'https://en.wikipedia.org/wiki/Katholieke_Universiteit_Leuven'),
 ('Bosnia and Herzegovina',
  'University of Sarajevo',
  1949,
  'Public',
  30866,
  'https://en.wikipedia.org/wiki/University_of_Sarajevo'),
 ('Botswana',
  'University of Botswana',
  1982,
  'Public',
  32000,
  'https://en.wikipedia.org/wiki/University_of_Botswana'),
 ('Brazil',
  'Estácio de Sá University',
  1970,
  'Private',
  215000,
  'https://en.wikipedia.org/wiki/Est%C3%A1cio_de_S%C3%A1_University'),
 ('Bulgaria',
  'Sofia University',
  1888,
  'Public',
  18911,
  'https://en.wikipedia.org/wiki/Sofia_University'),
 ('Canada',
  'University of Toronto',
  1827,
  'Public',
  84000,
  'https://en.wikipedia.org/wiki/University_of_Toronto'),
 ('China',
  'Shanghai Open University',
  1960,
  'Public',
  80000,
  'https://en.wikipedia.org/wiki/Shanghai_Open_University'),
 ('Colombia',
  'National University of Colombia',
  1867,
  'Public',
  53581,
  'https://en.wikipedia.org/wiki/National_University_of_Colombia'),
 ('Costa Rica',
  'Universidad de Costa Rica',
  1940,
  'Public',
  42750,
  'https://en.wikipedia.org/wiki/Universidad_de_Costa_Rica'),
 ('Croatia',
  'University of Zagreb',
  1669,
  'Public',
  72480,
  'https://en.wikipedia.org/wiki/University_of_Zagreb'),
 ('Denmark',
  'Aarhus University',
  1928,
  'Public',
  43600,
  'https://en.wikipedia.org/wiki/Aarhus_University'),
 ('Dominican Republic',
  'Universidad Autónoma de Santo Domingo',
  1538,
  'Public',
  170530,
  'https://en.wikipedia.org/wiki/Universidad_Aut%C3%B3noma_de_Santo_Domingo'),
 ('Egypt',
  'Ain Shams University',
  1950,
  'Public',
  170000,
  'https://en.wikipedia.org/wiki/Ain_Shams_University'),
 ('Finland',
  'University of Helsinki',
  1640,
  'Public',
  36500,
  'https://en.wikipedia.org/wiki/University_of_Helsinki'),
 ('France',
  "Centre national d'enseignement à distance",
  1939,
  'Public',
  350000,
  'https://en.wikipedia.org/wiki/Centre_national_d%27enseignement_%C3%A0_distance'),
 ('Germany',
  'IU International University of Applied Sciences',
  1998,
  'Private',
  130000,
  'https://en.wikipedia.org/wiki/IU_International_University_of_Applied_Sciences'),
 ('Greece',
  'National and Kapodistrian University of Athens',
  1837,
  'Public',
  104000,
  'https://en.wikipedia.org/wiki/National_and_Kapodistrian_University_of_Athens'),
 ('Guatemala',
  'Universidad de San Carlos de Guatemala',
  1676,
  'Public',
  124000,
  'https://en.wikipedia.org/wiki/Universidad_de_San_Carlos_de_Guatemala'),
 ('Hong Kong',
  'Hong Kong Polytechnic University',
  1937,
  'Public',
  32000,
  'https://en.wikipedia.org/wiki/Hong_Kong_Polytechnic_University'),
 ('Iceland',
  'University of Iceland',
  1911,
  'Public',
  13782,
  'https://en.wikipedia.org/wiki/University_of_Iceland'),
 ('India',
  'Indira Gandhi National Open University',
  1985,
  'Public',
  7140,
  'https://en.wikipedia.org/wiki/Indira_Gandhi_National_Open_University'),
 ('Indonesia',
  'Universitas Terbuka',
  1984,
  'Public',
  1045,
  'https://en.wikipedia.org/wiki/Universitas_Terbuka'),
 ('Iran',
  'Islamic Azad University',
  1982,
  'Semi-private',
  1000,
  'https://en.wikipedia.org/wiki/Islamic_Azad_University'),
 ('Ireland',
  'University College Dublin',
  1834,
  'Public (formerly private)',
  32900,
  'https://en.wikipedia.org/wiki/University_College_Dublin'),
 ('Israel',
  'Tel Aviv University',
  1956,
  'Public',
  26023,
  'https://en.wikipedia.org/wiki/Tel_Aviv_University'),
 ('Italy',
  'Sapienza University of Rome',
  1303,
  'Public',
  112564,
  'https://en.wikipedia.org/wiki/Sapienza_University_of_Rome'),
 ('Japan',
  'Nihon University',
  1889,
  'Private',
  70667,
  'https://en.wikipedia.org/wiki/Nihon_University'),
 ('Kenya',
  'University of Nairobi',
  1970,
  'Public',
  84000,
  'https://en.wikipedia.org/wiki/University_of_Nairobi'),
 ('Kosovo',
  'Universiteti i Prishtinës',
  1999,
  'Public',
  41833,
  'https://en.wikipedia.org/wiki/Universiteti_i_Prishtin%C3%ABs'),
 ('Lithuania',
  'Vilnius University',
  1579,
  'Public',
  23606,
  'https://en.wikipedia.org/wiki/Vilnius_University'),
 ('Macau',
  'Macau University of Science and Technology',
  2000,
  'Private',
  10373,
  'https://en.wikipedia.org/wiki/Macau_University_of_Science_and_Technology'),
 ('Malaysia',
  'Universiti Teknologi MARA',
  1956,
  'Public',
  100000,
  'https://en.wikipedia.org/wiki/Universiti_Teknologi_MARA'),
 ('Mexico',
  'National Autonomous University of Mexico',
  1551,
  'Public',
  349515,
  'https://en.wikipedia.org/wiki/National_Autonomous_University_of_Mexico'),
 ('Nepal',
  'Tribhuvan University',
  1959,
  'Public',
  604437,
  'https://en.wikipedia.org/wiki/Tribhuvan_University'),
 ('Netherlands',
  'University of Amsterdam',
  1632,
  'Public',
  31186,
  'https://en.wikipedia.org/wiki/University_of_Amsterdam'),
 ('New Zealand',
  'University of Auckland',
  1883,
  'Public',
  33050,
  'https://en.wikipedia.org/wiki/University_of_Auckland'),
 ('North Macedonia',
  'University of Skopje',
  1943,
  'Public',
  50000,
  'https://en.wikipedia.org/wiki/University_of_Skopje'),
 ('Norway',
  'Norwegian University of Science and Technology',
  1996,
  'Public',
  39000,
  'https://en.wikipedia.org/wiki/Norwegian_University_of_Science_and_Technology'),
 ('Pakistan',
  'Virtual University of Pakistan',
  2002,
  'Public',
  165000,
  'https://en.wikipedia.org/wiki/Virtual_University_of_Pakistan'),
 ('Peru',
  'National University of San Marcos',
  1551,
  'Private',
  37032,
  'https://en.wikipedia.org/wiki/National_University_of_San_Marcos'),
 ('Philippines',
  'Polytechnic University of the Philippines',
  1904,
  'Public',
  68249,
  'https://en.wikipedia.org/wiki/Polytechnic_University_of_the_Philippines'),
 ('Poland',
  'University of Warsaw',
  1816,
  'Public',
  44400,
  'https://en.wikipedia.org/wiki/University_of_Warsaw'),
 ('Portugal',
  'University of Lisbon',
  1288,
  'Public',
  48100,
  'https://en.wikipedia.org/wiki/University_of_Lisbon'),
 ('Romania',
  'Spiru Haret University',
  1991,
  'Private',
  311928,
  'https://en.wikipedia.org/wiki/Spiru_Haret_University'),
 ('Russia',
  'Modern University for the Humanities',
  1992,
  'Private',
  200000,
  'https://en.wikipedia.org/wiki/Modern_University_for_the_Humanities'),
 ('Saudi Arabia',
  'King Abdulaziz University',
  1976,
  'Public',
  177234,
  'https://en.wikipedia.org/wiki/King_Abdulaziz_University'),
 ('Singapore',
  'National University of Singapore',
  1905,
  'Public',
  38300,
  'https://en.wikipedia.org/wiki/National_University_of_Singapore'),
 ('Slovenia',
  'University of Ljubljana',
  1919,
  'Public',
  48821,
  'https://en.wikipedia.org/wiki/University_of_Ljubljana'),
 ('South Africa',
  'University of South Africa',
  1873,
  'Public',
  328179,
  'https://en.wikipedia.org/wiki/University_of_South_Africa'),
 ('South Korea',
  'Korea National Open University',
  1972,
  'Public',
  173758,
  'https://en.wikipedia.org/wiki/Korea_National_Open_University'),
 ('Spain',
  'National University of Distance Education',
  1972,
  'Public',
  260079,
  'https://en.wikipedia.org/wiki/National_University_of_Distance_Education'),
 ('Sweden',
  'Lund University',
  1666,
  'Public',
  30646,
  'https://en.wikipedia.org/wiki/Lund_University'),
 ('Switzerland',
  'University of Zurich',
  1833,
  'Public',
  26356,
  'https://en.wikipedia.org/wiki/University_of_Zurich'),
 ('Taiwan',
  'National Taiwan University',
  1928,
  'Public',
  31758,
  'https://en.wikipedia.org/wiki/National_Taiwan_University'),
 ('Thailand',
  'Ramkhamhaeng University',
  1971,
  'Public',
  525000,
  'https://en.wikipedia.org/wiki/Ramkhamhaeng_University'),
 ('Trinidad and Tobago',
  'University of the West Indies',
  1960,
  'Public',
  60000,
  'https://en.wikipedia.org/wiki/University_of_the_West_Indies'),
 ('Turkey',
  'Anadolu University',
  1958,
  'Public',
  1969,
  'https://en.wikipedia.org/wiki/Anadolu_University'),
 ('United Kingdom',
  'Open University',
  1969,
  'Public',
  253075,
  'https://en.wikipedia.org/wiki/Open_University'),
 ('United States',
  'Texas A&M University',
  1876,
  'Public',
  73284,
  'https://en.wikipedia.org/wiki/Texas_A%26M_University'),
 ('Uruguay',
  'University of the Republic',
  1949,
  'Public',
  144108,
  'https://en.wikipedia.org/wiki/University_of_the_Republic'),
 ('Venezuela',
  'Universidad Central de Venezuela',
  1721,
  'Public',
  41059,
  'https://en.wikipedia.org/wiki/Universidad_Central_de_Venezuela')]

## 7. Create SQLAlchemy Engine

In [27]:
engine = create_engine('mysql+pymysql://', creator=lambda:conn)

In [28]:
pd.read_sql('SELECT * FROM university;', con=engine)

Empty DataFrame
Columns: [id, country, name, founded, type, enrollment, link]
Index: []

## 8. Load Data into the Database
Open and read the SQL script file 'mysql_upsert.sql'. The script contains the SQL command for inseting the scraped data into the table.

In [34]:
# load data into the database

merge_query_file = open('./sql/mysql_upsert.sql')
merge_query = merge_query_file.read()
merge_query

'-- Active: 1720513473051@@127.0.0.1@3306@amdaridb\nINSERT INTO university (country, name, founded, type, enrollment, link)\nVALUES (%s, %s, %s, %s, %s, %s)\nON DUPLICATE KEY UPDATE\n    founded = VALUES(founded),\n    type = VALUES(type),\n    enrollment = VALUES(enrollment),\n    link = VALUES(link);\n'

In [35]:
cursor.executemany(merge_query, data)

69

In [1]:
# save changes to the database
conn.commit()

NameError: name 'conn' is not defined

## 9. Verify Data loading

In [39]:
# read the contents of the university table again to verify that the data has been inserted successfully
pd.read_sql("SELECT * FROM university;", con= engine)

,id,country,name,founded,type,enrollment,link
0,1,Albania,University of Tirana,1957,Public,35000,https://en.wikipedia.org/wiki/University_of_Ti...
1,2,Algeria,Constantine University,1978,Public,85000,https://en.wikipedia.org/wiki/List_of_universi...
2,3,Angola,Agostinho Neto University,1962,Public,29827,https://en.wikipedia.org/wiki/Agostinho_Neto_U...
3,4,Argentina,University of Buenos Aires,1821,Public,311175,https://en.wikipedia.org/wiki/University_of_Bu...
4,5,Australia,Monash University,1958,Public,73807,https://en.wikipedia.org/wiki/Monash_University
...,...,...,...,...,...,...,...
64,65,Turkey,Anadolu University,1958,Public,1969,https://en.wikipedia.org/wiki/Anadolu_University
65,66,United Kingdom,Open University,1969,Public,253075,https://en.wikipedia.org/wiki/Open_University
66,67,United States,Texas A&M University,1876,Public,73284,https://en.wikipedia.org/wiki/Texas_A%26M_Univ...
67,68,Uruguay,University of the Republic,1949,Public,144108,https://en.wikipedia.org/wiki/University_of_th...
68,69,Venezuela,Universidad Central de Venezuela,1721,Public,41059,https://en.wikipedia.org/wiki/Universidad_Cent...

## Conclusion
I loaded the cleaned data from a CSV file into a MySQL database using pandas, pymysql, and SQLAlchemy. I can efficiently manage and interact with your MySQL database.